package de.telran.javastart.Lessons.lesson19;

//  ДЗ Basic Java:
//   1. Написать метод, который принимает на вход строку и возвращает true
//   если эта строка является полиндромом (игнорируя регистр). Пример: "Алла" -> true.

//   2. Напишите метод, принимающий на вход строку и подстроку и
//   возвращающий количество вхождений подстроки в строку. Пример: "Hello world", "l" -> 3.

//   3. * Напишите метод, который вернет количество слов в переданной в него строке.
//   Считаем, что слова отделяются пробелами. Пример: "Hello world" -> 2.

//   4. ** Напишите метод, в который передается строка и число N.
//   Метод возвращает строку, состоящую из начала исходной строки и полных слов,
//   не превышающих по длине N символов. "Hello world guys", 11 -> "Hello world" . "Hello world guys", 6 -> "Hello".

//   5. * Напишите функцию, которая возвращает предпоследнее слово переданной в нее строки.
//   Пример: "Олени идут на север" -> "на"

public class Lesson19_Homework {
    public static void main(String[] args) {

    }
}
